tutorials/reactorCases/2D_cavityMSFR_Reactor/constant/fluidRegion/FPCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       ______          _   __           ______                               |
|      / ____/  ___    / | / /          / ____/  ____   ____ _   ____ ___     |
|     / / __   / _ \  /  |/ /  ______  / /_     / __ \ / __ `/  / __ `__ \    |
|    / /_/ /  /  __/ / /|  /  /_____/ / __/    / /_/ // /_/ /  / / / / / /    |
|    \____/   \___/ /_/ |_/          /_/       \____/ \__,_/  /_/ /_/ /_/     |
|    Copyright (C) 2015 - 2022 EPFL                                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      FPCloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// This case is a flow+temperature+neutronics comparison, not a particle
// tracking one: the cloud is kept present (msfrParcelFoam builds it
// unconditionally) but entirely inert -- no injection means no parcels are
// ever added.

solution
{
    active          true;
    coupledU        false;
    coupledT        false;
    transient       yes;
    cellValueSourceCorrection off;

    maxCo           0.3;

    interpolationSchemes
    {
        rho             cell;
        U               cellPoint;
        muc             cell;
        T               cell;
        vort            cell;
        gradT           cell;
    }

    integrationSchemes
    {
        U               Euler;
        T               Euler;
    }

    sourceTerms
    {
        schemes
        {
            U           semiImplicit 1;
            T           semiImplicit 1;
        }
    }
}

constantProperties
{
    parcelTypeId    1;

    rhoMin          1e-15;
    rho0            8000;
    minParcelMass   1e-15;

    lambda          0;

    T0              900;
    TMin            200;
    TMax            2000;
    Cp0             450;
    epsilon0        1;
    kappa0          15;
    mu0             0;
    f0              0.5;
}

subModels
{
    particleForces
    {}

    injectionModels
    {}

    dispersionModel none;

    patchInteractionModel localInteraction;

    localInteractionCoeffs
    {
        patches
        (
            "(.*Wall)"
            {
                type escape;
            }
        );
    }

    heatTransferModel none;

    decayHeatModel  none;

    radiation       false;

    surfaceFilmModel none;

    stochasticCollisionModel none;
}

cloudFunctions
{}


// ************************************************************************* //
