tutorials/reactorCases/2D_cavityMSFR_Reactor/constant/fluidRegion/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/fluidRegion";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Volumetric heat-exchanger sink applied to T everywhere, so the domain has
// somewhere for the fission power to go (walls are adiabatic, radiation is
// off). Newton-cooling towards Text: dT/dt += h*(Text - T)/rhocp, split into
// its explicit (h*Text/rhocp) and implicit (-h/rhocp) parts. rhocp matches
// CpRef*rhoInf from transportProperties (3075 * 2000 = 6.15e6).
heatExchanger
{
    type            scalarSemiImplicitSource;
    active          true;

    selectionMode   all;
    volumeMode      specific;

    sources
    {
        T
        {
            explicit    146.34146341463415; // h*Text/rhocp = 1e6*900/6.15e6
            implicit    -0.16260162601626016; // -h/rhocp = -1e6/6.15e6
        }
    }
}

// ************************************************************************* //
