tutorials/reactorCases/2D_cavityMSFR_Reactor/constant/fluidRegion/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

// Laminar viscosity
nu              [0 2 -1 0 0 0 0] 0.025;

// Thermal expansion coefficient
beta            [0 0 0 -1 0 0 0] 2.0e-04;

// Reference temperature
TRef            [0 0 0 1 0 0 0] 900;

// Reference density (msfrParcelFoam looks this up as "rhoInf", not "rhoRef")
rhoInf          [1 -3 0 0 0 0 0] 2000;

// Reference specific heat capacity
CpRef           [0 2 -2 -1 0 0 0] 3075;

// Laminar Prandtl number
Pr              [0 0 0 0 0 0 0] 3.075e+05;

// Turbulent Prandtl number
Prt             [0 0 0 0 0 0 0] 0.85;

// Laminar Prandtl number
Sc              [0 0 0 0 0 0 0] 2.0e+08;

// Turbulent Prandtl number
Sct             [0 0 0 0 0 0 0] 0.85;

// ************************************************************************* //
