tutorials/reactorCases/2D_cavityMSFR_Reactor/system/fluidRegion/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
     (-1 -0.5 -1)
     ( 1 -0.5 -1)
     ( 1  0.5 -1)
     (-1  0.5 -1)
     (-1 -0.5  1)
     ( 1 -0.5  1)
     ( 1  0.5  1)
     (-1  0.5  1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 1 100) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (4 5 6 7)
        );
    }
    bottomWall
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }
    rightWall
    {
        type wall;
        faces
        (
            (1 2 5 6)
        );
    }
    leftWall
    {
        type wall;
        faces
        (
            (0 3 7 4)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (3 2 6 7)
            (0 1 5 4)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
