tutorials/reactorCases/2D_cavityMSFR_Reactor/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "p.*"
    {
        solver          GAMG;
        smoother        DIC;

        tolerance       1e-9;
        relTol          1e-3;
        maxIter         100;
    }

    "p.*Final"
    {
        $p_rgh;
        relTol          0;
    }

    "(U|k|epsilon|omega|R)"
    {
        solver          GAMG;
        smoother        GaussSeidel;

        tolerance       1e-9;
        relTol          1e-3;
        maxIter         100;
    }

    "(U|k|epsilon|omega|R)Final"
    {
        $U;
        relTol          0;
    }

    T
    {
        solver PBiCG;
        preconditioner DILU;


        tolerance       1e-9;
        relTol          1e-3;
        maxIter         100;
    }

    TFinal
    {
        $T;
        relTol          0;
    }

    "flux.*"
    {
        solver          GAMG;
        smoother        DIC;
        
        tolerance       1e-9;
        relTol          1e-3;
        maxIter         100;
    }

    "flux.*Final"
    {
        $flux1;
        relTol          0;
    }

    "(prec|dec).*"
    {
        solver          GAMG;
        smoother        GaussSeidel;
        
        tolerance       1e-9;
        relTol          1e-3;
        maxIter         100; 
    }

    "(prec|dec).*Final"
    {
        $prec1;
        relTol          0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    consistent yes;

    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        "p.*"               1e-7;
        T                   1e-7;
        "(U|k|epsilon)"     1e-7;
        "flux.*"            1e-9;
        "(prec|dec).*"      1e-9;
    }
}

relaxationFactors
{
    fields
    {
        "p.*"               1;
    }
    equations
    {
        T                   0.9;
        "(U|k|epsilon)"     0.5;
        "flux.*"            0.9;
        "(prec|dec).*"      0.9;
    }
}

// ************************************************************************* //
