tutorials/reactorCases/2D_cavityMSFR_Reactor/system/regionsDict
/*--------------------------------*- C++ -*----------------------------------*\
|       ______          _   __           ______                               |
|      / ____/  ___    / | / /          / ____/  ____   ____ _   ____ ___     |
|     / / __   / _ \  /  |/ /  ______  / /_     / __ \ / __ `/  / __ `__ \    |
|    / /_/ /  /  __/ / /|  /  /_____/ / __/    / /_/ // /_/ /  / / / / / /    |
|    \____/   \___/ /_/ |_/          /_/       \____/ \__,_/  /_/ /_/ /_/     |
|    Copyright (C) 2015 - 2022 EPFL                                           |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      regionsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Baseline (OldParcelFoam) variant: single region, own inline neutronics.
// Kept as a validated reference/comparison implementation -- see
// msfrParcelFoam (applications/modules/openFoamImported/msfrParcelFoam) for
// the actively-developed solver, which couples to a separate neutroRegion
// running foamForNuclear's own native neutronics module instead.

regionSolvers
{
    Level_0
    {
        fluidRegion     OldParcelFoam;
    }
}

mappings
{
    fluidRegion
    {}
}

// ************************************************************************* //
